SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_rac.h
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6875                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p6875 << 17)        /**< Shifted mode vref_0p6875 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7000                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7000 << 17)        /**< Shifted mode vref_0p7000 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7125                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7125 << 17)        /**< Shifted mode vref_0p7125 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7250                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7250 << 17)        /**< Shifted mode vref_0p7250 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7375                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7375 << 17)        /**< Shifted mode vref_0p7375 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7500                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7500 << 17)        /**< Shifted mode vref_0p7500 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7625                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7625 << 17)        /**< Shifted mode vref_0p7625 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7750                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7750 << 17)        /**< Shifted mode vref_0p7750 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7875                     (_RAC_PATRIM3_TX6DBMTRIMREGVREF_vref_0p7875 << 17)        /**< Shifted mode vref_0p7875 for RAC_PATRIM3    */
#define _RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_SHIFT                       21                                                        /**< Shift value for RAC_TX6DBMTRIMRXMODEVREF    */
#define _RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_MASK                        0x600000UL                                                /**< Bit mask for RAC_TX6DBMTRIMRXMODEVREF       */
#define _RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_DEFAULT                     0x00000001UL                                              /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p05                 0x00000000UL                                              /**< Mode vddreg_1p05 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p14                 0x00000001UL                                              /**< Mode vddreg_1p14 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p20                 0x00000002UL                                              /**< Mode vddreg_1p20 for RAC_PATRIM3            */
#define _RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p23                 0x00000003UL                                              /**< Mode vddreg_1p23 for RAC_PATRIM3            */
#define RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_DEFAULT                      (_RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_DEFAULT << 21)         /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p05                  (_RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p05 << 21)     /**< Shifted mode vddreg_1p05 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p14                  (_RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p14 << 21)     /**< Shifted mode vddreg_1p14 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p20                  (_RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p20 << 21)     /**< Shifted mode vddreg_1p20 for RAC_PATRIM3    */
#define RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p23                  (_RAC_PATRIM3_TX6DBMTRIMRXMODEVREF_vddreg_1p23 << 21)     /**< Shifted mode vddreg_1p23 for RAC_PATRIM3    */

/* Bit fields for RAC PACTRL */
#define _RAC_PACTRL_RESETVALUE                                        0x00000010UL                                         /**< Default value for RAC_PACTRL                */
#define _RAC_PACTRL_MASK                                              0x1FFF033FUL                                         /**< Mask for RAC_PACTRL                         */
#define _RAC_PACTRL_TX0DBMPOWER_SHIFT                                 0                                                    /**< Shift value for RAC_TX0DBMPOWER             */
#define _RAC_PACTRL_TX0DBMPOWER_MASK                                  0xFUL                                                /**< Bit mask for RAC_TX0DBMPOWER                */
#define _RAC_PACTRL_TX0DBMPOWER_DEFAULT                               0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMPOWER_on_stripe_0                           0x00000000UL                                         /**< Mode on_stripe_0 for RAC_PACTRL             */
#define _RAC_PACTRL_TX0DBMPOWER_on_stripe_12                          0x0000000CUL                                         /**< Mode on_stripe_12 for RAC_PACTRL            */
#define RAC_PACTRL_TX0DBMPOWER_DEFAULT                                (_RAC_PACTRL_TX0DBMPOWER_DEFAULT << 0)               /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMPOWER_on_stripe_0                            (_RAC_PACTRL_TX0DBMPOWER_on_stripe_0 << 0)           /**< Shifted mode on_stripe_0 for RAC_PACTRL     */
#define RAC_PACTRL_TX0DBMPOWER_on_stripe_12                           (_RAC_PACTRL_TX0DBMPOWER_on_stripe_12 << 0)          /**< Shifted mode on_stripe_12 for RAC_PACTRL    */
#define _RAC_PACTRL_TX0DBMSELSLICE_SHIFT                              4                                                    /**< Shift value for RAC_TX0DBMSELSLICE          */
#define _RAC_PACTRL_TX0DBMSELSLICE_MASK                               0x30UL                                               /**< Bit mask for RAC_TX0DBMSELSLICE             */
#define _RAC_PACTRL_TX0DBMSELSLICE_DEFAULT                            0x00000001UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMSELSLICE_on_0_slice                         0x00000000UL                                         /**< Mode on_0_slice for RAC_PACTRL              */
#define _RAC_PACTRL_TX0DBMSELSLICE_on_1_slices                        0x00000001UL                                         /**< Mode on_1_slices for RAC_PACTRL             */
#define _RAC_PACTRL_TX0DBMSELSLICE_on_2_slices                        0x00000002UL                                         /**< Mode on_2_slices for RAC_PACTRL             */
#define _RAC_PACTRL_TX0DBMSELSLICE_NA                                 0x00000003UL                                         /**< Mode NA for RAC_PACTRL                      */
#define RAC_PACTRL_TX0DBMSELSLICE_DEFAULT                             (_RAC_PACTRL_TX0DBMSELSLICE_DEFAULT << 4)            /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMSELSLICE_on_0_slice                          (_RAC_PACTRL_TX0DBMSELSLICE_on_0_slice << 4)         /**< Shifted mode on_0_slice for RAC_PACTRL      */
#define RAC_PACTRL_TX0DBMSELSLICE_on_1_slices                         (_RAC_PACTRL_TX0DBMSELSLICE_on_1_slices << 4)        /**< Shifted mode on_1_slices for RAC_PACTRL     */
#define RAC_PACTRL_TX0DBMSELSLICE_on_2_slices                         (_RAC_PACTRL_TX0DBMSELSLICE_on_2_slices << 4)        /**< Shifted mode on_2_slices for RAC_PACTRL     */
#define RAC_PACTRL_TX0DBMSELSLICE_NA                                  (_RAC_PACTRL_TX0DBMSELSLICE_NA << 4)                 /**< Shifted mode NA for RAC_PACTRL              */
#define RAC_PACTRL_TX0DBMSLICERESET                                   (0x1UL << 8)                                         /**< TX0DBMSLICERESET                            */
#define _RAC_PACTRL_TX0DBMSLICERESET_SHIFT                            8                                                    /**< Shift value for RAC_TX0DBMSLICERESET        */
#define _RAC_PACTRL_TX0DBMSLICERESET_MASK                             0x100UL                                              /**< Bit mask for RAC_TX0DBMSLICERESET           */
#define _RAC_PACTRL_TX0DBMSLICERESET_DEFAULT                          0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMSLICERESET_active                           0x00000000UL                                         /**< Mode active for RAC_PACTRL                  */
#define _RAC_PACTRL_TX0DBMSLICERESET_reset                            0x00000001UL                                         /**< Mode reset for RAC_PACTRL                   */
#define RAC_PACTRL_TX0DBMSLICERESET_DEFAULT                           (_RAC_PACTRL_TX0DBMSLICERESET_DEFAULT << 8)          /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMSLICERESET_active                            (_RAC_PACTRL_TX0DBMSLICERESET_active << 8)           /**< Shifted mode active for RAC_PACTRL          */
#define RAC_PACTRL_TX0DBMSLICERESET_reset                             (_RAC_PACTRL_TX0DBMSLICERESET_reset << 8)            /**< Shifted mode reset for RAC_PACTRL           */
#define RAC_PACTRL_TX0DBMLATCHBYPASS                                  (0x1UL << 9)                                         /**< TX0DBMLATCHBYPASS                           */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_SHIFT                           9                                                    /**< Shift value for RAC_TX0DBMLATCHBYPASS       */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_MASK                            0x200UL                                              /**< Bit mask for RAC_TX0DBMLATCHBYPASS          */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_DEFAULT                         0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_disable                         0x00000000UL                                         /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_TX0DBMLATCHBYPASS_enable                          0x00000001UL                                         /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_TX0DBMLATCHBYPASS_DEFAULT                          (_RAC_PACTRL_TX0DBMLATCHBYPASS_DEFAULT << 9)         /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMLATCHBYPASS_disable                          (_RAC_PACTRL_TX0DBMLATCHBYPASS_disable << 9)         /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_TX0DBMLATCHBYPASS_enable                           (_RAC_PACTRL_TX0DBMLATCHBYPASS_enable << 9)          /**< Shifted mode enable for RAC_PACTRL          */
#define _RAC_PACTRL_TX6DBMPOWER_SHIFT                                 16                                                   /**< Shift value for RAC_TX6DBMPOWER             */
#define _RAC_PACTRL_TX6DBMPOWER_MASK                                  0x1F0000UL                                           /**< Bit mask for RAC_TX6DBMPOWER                */
#define _RAC_PACTRL_TX6DBMPOWER_DEFAULT                               0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define RAC_PACTRL_TX6DBMPOWER_DEFAULT                                (_RAC_PACTRL_TX6DBMPOWER_DEFAULT << 16)              /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define _RAC_PACTRL_TX6DBMSELSLICE_SHIFT                              21                                                   /**< Shift value for RAC_TX6DBMSELSLICE          */
#define _RAC_PACTRL_TX6DBMSELSLICE_MASK                               0xE00000UL                                           /**< Bit mask for RAC_TX6DBMSELSLICE             */
#define _RAC_PACTRL_TX6DBMSELSLICE_DEFAULT                            0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_0                       0x00000000UL                                         /**< Mode n_slice_on_0 for RAC_PACTRL            */
#define _RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_1                       0x00000001UL                                         /**< Mode n_slice_on_1 for RAC_PACTRL            */
#define _RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_2                       0x00000002UL                                         /**< Mode n_slice_on_2 for RAC_PACTRL            */
#define _RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_3                       0x00000003UL                                         /**< Mode n_slice_on_3 for RAC_PACTRL            */
#define _RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_4                       0x00000004UL                                         /**< Mode n_slice_on_4 for RAC_PACTRL            */
#define _RAC_PACTRL_TX6DBMSELSLICE_tbd_5                              0x00000005UL                                         /**< Mode tbd_5 for RAC_PACTRL                   */
#define _RAC_PACTRL_TX6DBMSELSLICE_tbd_6                              0x00000006UL                                         /**< Mode tbd_6 for RAC_PACTRL                   */
#define _RAC_PACTRL_TX6DBMSELSLICE_tbd_7                              0x00000007UL                                         /**< Mode tbd_7 for RAC_PACTRL                   */
#define RAC_PACTRL_TX6DBMSELSLICE_DEFAULT                             (_RAC_PACTRL_TX6DBMSELSLICE_DEFAULT << 21)           /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_0                        (_RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_0 << 21)      /**< Shifted mode n_slice_on_0 for RAC_PACTRL    */
#define RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_1                        (_RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_1 << 21)      /**< Shifted mode n_slice_on_1 for RAC_PACTRL    */
#define RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_2                        (_RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_2 << 21)      /**< Shifted mode n_slice_on_2 for RAC_PACTRL    */
#define RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_3                        (_RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_3 << 21)      /**< Shifted mode n_slice_on_3 for RAC_PACTRL    */
#define RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_4                        (_RAC_PACTRL_TX6DBMSELSLICE_n_slice_on_4 << 21)      /**< Shifted mode n_slice_on_4 for RAC_PACTRL    */
#define RAC_PACTRL_TX6DBMSELSLICE_tbd_5                               (_RAC_PACTRL_TX6DBMSELSLICE_tbd_5 << 21)             /**< Shifted mode tbd_5 for RAC_PACTRL           */
#define RAC_PACTRL_TX6DBMSELSLICE_tbd_6                               (_RAC_PACTRL_TX6DBMSELSLICE_tbd_6 << 21)             /**< Shifted mode tbd_6 for RAC_PACTRL           */
#define RAC_PACTRL_TX6DBMSELSLICE_tbd_7                               (_RAC_PACTRL_TX6DBMSELSLICE_tbd_7 << 21)             /**< Shifted mode tbd_7 for RAC_PACTRL           */
#define RAC_PACTRL_TX6DBMSLICERESET                                   (0x1UL << 24)                                        /**< TX6DBMSLICERESET                            */
#define _RAC_PACTRL_TX6DBMSLICERESET_SHIFT                            24                                                   /**< Shift value for RAC_TX6DBMSLICERESET        */
#define _RAC_PACTRL_TX6DBMSLICERESET_MASK                             0x1000000UL                                          /**< Bit mask for RAC_TX6DBMSLICERESET           */
#define _RAC_PACTRL_TX6DBMSLICERESET_DEFAULT                          0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX6DBMSLICERESET_disable_reset                    0x00000000UL                                         /**< Mode disable_reset for RAC_PACTRL           */
#define _RAC_PACTRL_TX6DBMSLICERESET_enable_reset                     0x00000001UL                                         /**< Mode enable_reset for RAC_PACTRL            */
#define RAC_PACTRL_TX6DBMSLICERESET_DEFAULT                           (_RAC_PACTRL_TX6DBMSLICERESET_DEFAULT << 24)         /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX6DBMSLICERESET_disable_reset                     (_RAC_PACTRL_TX6DBMSLICERESET_disable_reset << 24)   /**< Shifted mode disable_reset for RAC_PACTRL   */
#define RAC_PACTRL_TX6DBMSLICERESET_enable_reset                      (_RAC_PACTRL_TX6DBMSLICERESET_enable_reset << 24)    /**< Shifted mode enable_reset for RAC_PACTRL    */
#define RAC_PACTRL_TX6DBMLATCHBYPASS                                  (0x1UL << 25)                                        /**< TX6DBMLATCHBYPASS                           */
#define _RAC_PACTRL_TX6DBMLATCHBYPASS_SHIFT                           25                                                   /**< Shift value for RAC_TX6DBMLATCHBYPASS       */
#define _RAC_PACTRL_TX6DBMLATCHBYPASS_MASK                            0x2000000UL                                          /**< Bit mask for RAC_TX6DBMLATCHBYPASS          */
#define _RAC_PACTRL_TX6DBMLATCHBYPASS_DEFAULT                         0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX6DBMLATCHBYPASS_not_bypass                      0x00000000UL                                         /**< Mode not_bypass for RAC_PACTRL              */
#define _RAC_PACTRL_TX6DBMLATCHBYPASS_bypass_latch                    0x00000001UL                                         /**< Mode bypass_latch for RAC_PACTRL            */
#define RAC_PACTRL_TX6DBMLATCHBYPASS_DEFAULT                          (_RAC_PACTRL_TX6DBMLATCHBYPASS_DEFAULT << 25)        /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX6DBMLATCHBYPASS_not_bypass                       (_RAC_PACTRL_TX6DBMLATCHBYPASS_not_bypass << 25)     /**< Shifted mode not_bypass for RAC_PACTRL      */
#define RAC_PACTRL_TX6DBMLATCHBYPASS_bypass_latch                     (_RAC_PACTRL_TX6DBMLATCHBYPASS_bypass_latch << 25)   /**< Shifted mode bypass_latch for RAC_PACTRL    */
#define RAC_PACTRL_TX6DBMPREDRVREGBYPASS                              (0x1UL << 26)                                        /**< TX6DBMREGBYPASSPDRVLDo                      */
#define _RAC_PACTRL_TX6DBMPREDRVREGBYPASS_SHIFT                       26                                                   /**< Shift value for RAC_TX6DBMPREDRVREGBYPASS   */
#define _RAC_PACTRL_TX6DBMPREDRVREGBYPASS_MASK                        0x4000000UL                                          /**< Bit mask for RAC_TX6DBMPREDRVREGBYPASS      */
#define _RAC_PACTRL_TX6DBMPREDRVREGBYPASS_DEFAULT                     0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX6DBMPREDRVREGBYPASS_not_bypass                  0x00000000UL                                         /**< Mode not_bypass for RAC_PACTRL              */
#define _RAC_PACTRL_TX6DBMPREDRVREGBYPASS_bypass                      0x00000001UL                                         /**< Mode bypass for RAC_PACTRL                  */
#define RAC_PACTRL_TX6DBMPREDRVREGBYPASS_DEFAULT                      (_RAC_PACTRL_TX6DBMPREDRVREGBYPASS_DEFAULT << 26)    /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX6DBMPREDRVREGBYPASS_not_bypass                   (_RAC_PACTRL_TX6DBMPREDRVREGBYPASS_not_bypass << 26) /**< Shifted mode not_bypass for RAC_PACTRL      */
#define RAC_PACTRL_TX6DBMPREDRVREGBYPASS_bypass                       (_RAC_PACTRL_TX6DBMPREDRVREGBYPASS_bypass << 26)     /**< Shifted mode bypass for RAC_PACTRL          */
#define RAC_PACTRL_TX6DBMPULLDOWNREG                                  (0x1UL << 27)                                        /**< TX6DBMPULLDOWNREG                           */
#define _RAC_PACTRL_TX6DBMPULLDOWNREG_SHIFT                           27                                                   /**< Shift value for RAC_TX6DBMPULLDOWNREG       */
#define _RAC_PACTRL_TX6DBMPULLDOWNREG_MASK                            0x8000000UL                                          /**< Bit mask for RAC_TX6DBMPULLDOWNREG          */
#define _RAC_PACTRL_TX6DBMPULLDOWNREG_DEFAULT                         0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX6DBMPULLDOWNREG_not_pull_down                   0x00000000UL                                         /**< Mode not_pull_down for RAC_PACTRL           */
#define _RAC_PACTRL_TX6DBMPULLDOWNREG_pull_down                       0x00000001UL                                         /**< Mode pull_down for RAC_PACTRL               */
#define RAC_PACTRL_TX6DBMPULLDOWNREG_DEFAULT                          (_RAC_PACTRL_TX6DBMPULLDOWNREG_DEFAULT << 27)        /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX6DBMPULLDOWNREG_not_pull_down                    (_RAC_PACTRL_TX6DBMPULLDOWNREG_not_pull_down << 27)  /**< Shifted mode not_pull_down for RAC_PACTRL   */
#define RAC_PACTRL_TX6DBMPULLDOWNREG_pull_down                        (_RAC_PACTRL_TX6DBMPULLDOWNREG_pull_down << 27)      /**< Shifted mode pull_down for RAC_PACTRL       */
#define RAC_PACTRL_TX6DBMREGBYPASS                                    (0x1UL << 28)                                        /**< TX6DBMREGBYPASS                             */
#define _RAC_PACTRL_TX6DBMREGBYPASS_SHIFT                             28                                                   /**< Shift value for RAC_TX6DBMREGBYPASS         */
#define _RAC_PACTRL_TX6DBMREGBYPASS_MASK                              0x10000000UL                                         /**< Bit mask for RAC_TX6DBMREGBYPASS            */
#define _RAC_PACTRL_TX6DBMREGBYPASS_DEFAULT                           0x00000000UL                                         /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_TX6DBMREGBYPASS_not_bypass                        0x00000000UL                                         /**< Mode not_bypass for RAC_PACTRL              */
#define _RAC_PACTRL_TX6DBMREGBYPASS_bypass                            0x00000001UL                                         /**< Mode bypass for RAC_PACTRL                  */
#define RAC_PACTRL_TX6DBMREGBYPASS_DEFAULT                            (_RAC_PACTRL_TX6DBMREGBYPASS_DEFAULT << 28)          /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_TX6DBMREGBYPASS_not_bypass                         (_RAC_PACTRL_TX6DBMREGBYPASS_not_bypass << 28)       /**< Shifted mode not_bypass for RAC_PACTRL      */
#define RAC_PACTRL_TX6DBMREGBYPASS_bypass                             (_RAC_PACTRL_TX6DBMREGBYPASS_bypass << 28)           /**< Shifted mode bypass for RAC_PACTRL          */

